src/Catalogs/ПодтверждающиеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПодтверждающиеДокументы</Name>
			<Comment>Данные всех подтверждающих документов по всем объектам</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
				<xr:Item>Catalog.ПодразделенияКомпании</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПодтверждающегоДокумента</Name>
					<Comment>Вид подтверждающего документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Comment>Дата выдачи подтверждающего документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдан</Name>
					<Comment>Кем выдан подтверждающий документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Comment>Номер бланка подтверждающего документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текущий</Name>
					<Comment>Признак того, что документ актуален в данный момент</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Устаревший</Name>
					<Comment>Признак того, что документ устарел и не используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДоверенности</Name>
					<Comment>Паспорт или др. удостоверение личности для доверенности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, от которого получают материальные ценности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания срока действия подтверждающего документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодразделения</Name>
					<Comment>Код подразделения в паспорте</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алкоголь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Таблица товаров и услуг</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВидыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДокументов</Name>
			<Comment>Виды подтверждающих документов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свидетельство</Name>
					<Comment>Свидетельство</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лицензия</Name>
					<Comment>Лицензия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паспорт</Name>
					<Comment>Общегражданский паспорт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удостоверение</Name>
					<Comment>Удостоверение личности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доверенность</Name>
					<Comment>Доверенность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйБилет</Name>
					<Comment>Военный билет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справка</Name>
					<Comment>Справка (например об освобождении)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидНаЖительствоИностранногоГражданина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий документ удостоверяющий личность</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
					<Comment>Индивидуальный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяФормаСобственности</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Comment>Обособленное подразделение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОбъектовСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовСведений</Name>
			<Comment>Виды объектов сведений</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
					<Comment>Руководитель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Comment>Главный бухгалтер</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
					<Comment>Кассир</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Материально ответственное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокПоставки</Name>
					<Comment>Срок поставки</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ПодтверждающиеДокументы/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Подтверждающие документы"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Функция перевод числа в пропись.
//
// Параметры:
//  Количество - Число - Переданное число.
//
// Возвращаемое значение:
//  Строка     - Число прописью.
//
Функция КоличествоПрописью(Количество)
	
	ЦелаяЧасть   = Цел(Количество);
	ДробнаяЧасть = Окр(Количество - ЦелаяЧасть, 3);
	Если ДробнаяЧасть = Окр(ДробнаяЧасть,0) Тогда
		ПараметрыПрописи = ", , , , , , , , 0";
	ИначеЕсли ДробнаяЧасть = Окр(ДробнаяЧасть, 1) Тогда
		ПараметрыПрописи = "целая, целых, целых, ж, десятая, десятых, десятых, м, 1";
	ИначеЕсли ДробнаяЧасть = Окр(ДробнаяЧасть, 2) Тогда
		ПараметрыПрописи = "целая, целых, целых, ж, сотая, сотых, сотых, м, 2";
	Иначе
		ПараметрыПрописи = "целая, целых, целых, ж, тысячная, тысячных, тысячных, м, 3";
	КонецЕсли;
	Возврат ЧислоПрописью(Количество, ,ПараметрыПрописи);
	
КонецФункции // КоличествоПрописью()

// Возвращает последний документ переданного вида для объекта (организации, контрагента, сотрудника,
// контактного лица, номенклатуры).
//
// Параметры
//  Объект       - СправочникСсылка - Владелец подтверждающего документа
//  ВидДокумента - ПеречислениеСсылка - Вид подтверждающего документа.
//
// Возвращаемое значение:
//   СправочникСсылка - Текущий подтверждающий документ.
//
Функция ПолучитьПодтверждающийДокументОбъектаПоВиду(Объект, ВидДокумента=Неопределено) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПодтверждающиеДокументы.Ссылка КАК ПодтверждающийДокумент
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Объект";
	
	Если ВидДокумента <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидПодтверждающегоДокумента"
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|	И ПодтверждающиеДокументы.Устаревший = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодтверждающиеДокументы.Текущий УБЫВ,
	|	ПодтверждающиеДокументы.ДатаВыдачи УБЫВ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Объект",                      Объект);
	Запрос.УстановитьПараметр("ВидПодтверждающегоДокумента", ВидДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.ПодтверждающийДокумент, Справочники.ПодтверждающиеДокументы.ПустаяСсылка());
	
КонецФункции // ПолучитьПодтверждающийДокументОбъектаПоВиду()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("ВидПодтверждающегоДокумента");
	ОбязательныеРеквизиты.Добавить("Номер");
	ОбязательныеРеквизиты.Добавить("ДатаВыдачи");
	ОбязательныеРеквизиты.Добавить("Владелец");
	ОбязательныеРеквизиты.Добавить("Товары.Номенклатура");
	ОбязательныеРеквизиты.Добавить("Товары.Количество");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Обязательные поля таблицы товаров
	УникальныеТовары = Новый Массив();
	УникальныеТовары.Добавить("Номенклатура");
	УникальныеТовары.Добавить("ХарактеристикаНоменклатуры");
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Товары", УникальныеТовары);
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события формирует наименование.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Функция СформироватьНаименованиеПоУмолчанию(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Наименование = "";
	Если ЗначениеЗаполнено(Объект.ВидПодтверждающегоДокумента)
		И ЗначениеЗаполнено(Объект.ДатаВыдачи)
		И ЗначениеЗаполнено(Объект.ДатаВыдачи) Тогда
		
		СтрокаВыдачи = "";
		Если Объект.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Доверенность
			ИЛИ Объект.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Лицензия
			ИЛИ Объект.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Справка Тогда
			
			СтрокаВыдачи = " выдана " + Формат(Объект.ДатаВыдачи,"ДФ=dd.MM.yy");
		ИначеЕсли Объект.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Удостоверение Тогда
			СтрокаВыдачи = " выдано " + Формат(Объект.ДатаВыдачи,"ДФ=dd.MM.yy");
		Иначе
			СтрокаВыдачи = " выдан " + Формат(Объект.ДатаВыдачи,"ДФ=dd.MM.yy");
		КонецЕсли;
		
		Наименование = СокрЛП(Объект.ВидПодтверждающегоДокумента)
						+ " " + СокрЛП(Объект.Серия) + " № " + СокрЛП(Объект.Номер) + СтрокаВыдачи;
		
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции // СформироватьНаименованиеПоУмолчанию()

// Обработчик события возникающего при изменении данных реквизита "Устаревший".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура УстаревшийПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Обновляем отображение элементов формы
	Если Объект.Устаревший = Истина Тогда
		Объект.Текущий = Ложь;
	Иначе
		Объект.Текущий = Истина;
	КонецЕсли;
	
КонецПроцедуры // УстаревшийПриИзмененииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Текущий".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура ТекущийПриИзмененииНаСервере(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Обновляем отображение элементов формы
	Если Объект.Текущий = Истина Тогда
		Объект.Устаревший = Ложь;
	Иначе
		Объект.Устаревший = Истина;
	КонецЕсли;
	
КонецПроцедуры // ТекущийПриИзмененииНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ТоварыНоменклатураПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	Если ТипЗнч(Строка.Номенклатура) = ТипЗнч("Строка") Тогда
		Строка.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
		Строка.Коэффициент = 0;
		Строка.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	Иначе
		ОбработкаТабличнойЧастиТовары.НоменклатураПриИзменении(Объект, Строка, ПараметрыДействия);
			
		// Проверим, имеют ли смысл дальнейшие действия
		Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Отказ", ЛОЖЬ) Тогда
			Возврат;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Характеристика номенклатуры" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ТоварыКоличествоПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.КоличествоПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыКоличествоПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Справочник.ПодтверждающиеДокументы",
		"ПФ_MXL_М2",
		НСтр("ru = 'Доверенность М2'"),
		СсылкаНаДокумент);
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Справочник.ПодтверждающиеДокументы",
		"М2А",
		НСтр("ru = 'Доверенность М2-а'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_М2") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_М2",
															"М-2а",
															ПечатьДоверенностьМ2(МассивОбъектов, ОбъектыПечати, "ПечатьДоверенностьМ2"));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М2А") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"М2А",
															"М-2а",
															ПечатьДоверенностьМ2(МассивОбъектов, ОбъектыПечати, "ПечатьДоверенностьМ2А"));
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Процедура печати доверенности.
//
// Параметры:
//  ИмяБланка - Строка - Имя документа для печати.
//
Функция ПечатьДоверенностьМ2(МассивОбъектов, ОбъектыПечати, ИмяБланка) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПодтверждающиеДокументы_ДоверенностьМ2";
	ПервыйДокумент = Истина;
	
	Для Каждого Документ Из МассивОбъектов Цикл
		
		// новый документ должен быть на отдельной странице
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;

		Если Документ.ВидПодтверждающегоДокумента <> Перечисления.ВидыДокументов.Доверенность Тогда
			Продолжить;
		КонецЕсли;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ПодтверждающиеДокументы.ПФ_MXL_М2");
		
		// выводим свойства
		Свойства = УправлениеСвойствами.ПолучитьЗначенияСвойств(Документ.Ссылка, ЕстьРеквизит(Документ, , "ДополнительныеРеквизиты"));
		ЕстьГрузоотправитель = Свойства.Найти(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Грузоотправитель);
		Поставщик = Неопределено;
		Если ЕстьГрузоотправитель <> Неопределено Тогда
			Поставщик = ЕстьГрузоотправитель.Значение;
		КонецЕсли;
			
		Если НЕ ЗначениеЗаполнено(Поставщик) Тогда
			Поставщик = Документ.Контрагент;
		КонецЕсли;
		
		// часть для отреза
		Если ИмяБланка = "ПечатьДоверенностьМ2" Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Отрез");
			ОбластьМакета.Параметры.Заполнить(Документ);
			Если ТипЗнч(Документ.Владелец)=Тип("СправочникСсылка.Контрагенты") ИЛИ ТипЗнч(Документ.Владелец)=Тип("СправочникСсылка.Организации") Тогда
				ОбластьМакета.Параметры.ВладелецПредставление = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Документ.Владелец);
			ИначеЕсли ТипЗнч(Документ.Владелец)=Тип("СправочникСсылка.Сотрудники") Тогда
				ОбластьМакета.Параметры.ВладелецПредставление = ?(НЕ ЗначениеЗаполнено(Документ.Владелец.Должность),"",УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Документ.Владелец.Должность)+", ")+УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Документ.Владелец);
			Иначе
				ОбластьМакета.Параметры.Владелец=Неопределено;
				ОбластьМакета.Параметры.ВладелецПредставление=Неопределено;
			КонецЕсли;
			Если Поставщик<>Неопределено Тогда
				ОбластьМакета.Параметры.Поставщик=Поставщик;
				ОбластьМакета.Параметры.ПоставщикПредставление=УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Поставщик);
			КонецЕсли;
			
			// РеквизитыНаряда
			ТабличныйДокумент.Вывести(ОбластьМакета);
			НазваниеФормы = НСтр("ru = 'Типовая межотраслевая форма № М-2'");
		Иначе
			НазваниеФормы = НСтр("ru = 'Типовая межотраслевая форма № М-2а'");
		КонецЕсли;
		
		// Шапка документа
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Документ);
		ОбластьМакета.Параметры.НазваниеФормы            = НазваниеФормы;
		ОбластьМакета.Параметры.Организация              = ПараметрыСеанса.Организация;
		МассивДокументов = Новый Массив();
		МассивДокументов.Добавить(ПараметрыСеанса.Организация);
		ЮридическийАдресТаблица = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивДокументов, Перечисления.ТипыКонтактнойИнформации.Адрес,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		ЮридическийАдрес = "";
		Если ЗначениеЗаполнено(ЮридическийАдресТаблица) Тогда
			ЮридическийАдрес = ", " + ЮридическийАдресТаблица[0].Представление;
		КонецЕсли;
		ОбластьМакета.Параметры.ОрганизацияПредставление = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(ПараметрыСеанса.Организация) + ", ИНН " + ПараметрыСеанса.Организация.ИНН + ЮридическийАдрес;
		ОбластьМакета.Параметры.ОрганизацияКодПоОКПО     = ПараметрыСеанса.Организация.КодПоОКПО;
		ОбластьМакета.Параметры.РеквизитыПотребителя     = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(ПараметрыСеанса.Организация) + ЮридическийАдрес;
		ОбластьМакета.Параметры.РасчетныйСчет            = ПараметрыСеанса.Организация.ОсновнойБанковскийСчет;
		ОбластьМакета.Параметры.РеквизитыСчета           = "р/с" + " "+ПараметрыСеанса.Организация.ОсновнойБанковскийСчет.НомерСчета + " " + НСтр("ru = 'в банке'") + " "+УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(ПараметрыСеанса.Организация.ОсновнойБанковскийСчет.Банк)
		                                                   +", " + "БИК" + " "+ПараметрыСеанса.Организация.ОсновнойБанковскийСчет.Банк.Код;
		Если ТипЗнч(Документ.Владелец)=Тип("СправочникСсылка.Контрагенты") ИЛИ ТипЗнч(Документ.Владелец)=Тип("СправочникСсылка.Организации") Тогда
			ОбластьМакета.Параметры.Должность             = Неопределено;
			ОбластьМакета.Параметры.ВладелецПредставление = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Документ.Владелец);
		ИначеЕсли ТипЗнч(Документ.Владелец)=Тип("СправочникСсылка.Сотрудники") Тогда
			Должность = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Документ.Владелец.Должность);
			ОбластьМакета.Параметры.Должность             = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Должность,3,Документ.Владелец.Должность);
			ВладелецПредставление = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Документ.Владелец);
			ОбластьМакета.Параметры.ВладелецПредставление = СклонениеПредставленийОбъектов.ПросклонятьФИО(ВладелецПредставление,3,Документ.Владелец);
		Иначе
			ОбластьМакета.Параметры.Владелец=Неопределено;
			ОбластьМакета.Параметры.ВладелецПредставление=Неопределено;
		КонецЕсли;
		
		// Заполним по указанному паспорту
		Если ЗначениеЗаполнено(Документ.ДокументДоверенности) Тогда
			ОбластьМакета.Параметры.ПаспортСерия      = Документ.ДокументДоверенности.Серия;
			ОбластьМакета.Параметры.ПаспортНомер      = Документ.ДокументДоверенности.Номер;
			ОбластьМакета.Параметры.ПаспортВыдан      = Документ.ДокументДоверенности.КемВыдан;
			ОбластьМакета.Параметры.ПаспортДатаВыдачи = Документ.ДокументДоверенности.ДатаВыдачи;
		Иначе
			// подставим первый попавшийся паспорт
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
						 |	ПодтверждающиеДокументы.Серия,
						 |	ПодтверждающиеДокументы.Номер,
						 |	ПодтверждающиеДокументы.КемВыдан,
						 |	ПодтверждающиеДокументы.ДатаВыдачи
						 |ИЗ
						 |	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
						 |ГДЕ
						 |	ПодтверждающиеДокументы.Владелец = &Владелец
						 |	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидПодтверждающегоДокумента
						 |	И ПодтверждающиеДокументы.Устаревший = ЛОЖЬ
						 |
						 |УПОРЯДОЧИТЬ ПО
						 |	ПодтверждающиеДокументы.Текущий";
			Запрос.УстановитьПараметр("Владелец",Документ.Владелец);
			Запрос.УстановитьПараметр("ВидПодтверждающегоДокумента",Перечисления.ВидыДокументов.Паспорт);
			Выборка=Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ОбластьМакета.Параметры.ПаспортСерия      = Выборка.Серия;
				ОбластьМакета.Параметры.ПаспортНомер      = Выборка.Номер;
				ОбластьМакета.Параметры.ПаспортВыдан      = Выборка.КемВыдан;
				ОбластьМакета.Параметры.ПаспортДатаВыдачи = Выборка.ДатаВыдачи;
			КонецЕсли; 
		КонецЕсли;
		
		Если Поставщик<>Неопределено Тогда
			ОбластьМакета.Параметры.Поставщик=Поставщик;
			Представление = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Поставщик);
			Если Поставщик.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
				ОбластьМакета.Параметры.ПоставщикПредставление = СклонениеПредставленийОбъектов.ПросклонятьФИО(Представление, 2, Поставщик);
			Иначе
				ОбластьМакета.Параметры.ПоставщикПредставление= Представление;
			КонецЕсли;
		КонецЕсли;
		
		// РеквизитыДокументаНаПолучение
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Вывод шапки таблицы
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Вывод табличной части
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		Для каждого СтрокаТоваров Из Документ.Товары Цикл
			ОбластьМакета.Параметры.Заполнить(СтрокаТоваров);
			ОбластьМакета.Параметры.КоличествоПрописью = Формат(СтрокаТоваров.Количество,"ЧДЦ=3; ЧН=0,00") + " (" + КоличествоПрописью(СтрокаТоваров.Количество) + ")";
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
	
		// Вывод подвала
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		Руководитель = УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,Перечисления.ВидыОбъектовСведений.Руководитель,,ПараметрыСеанса.Организация);
		ОбластьМакета.Параметры.Заполнить(Руководитель);
		ГлавныйБухгалтер = УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер,,ПараметрыСеанса.Организация);
		ОбластьМакета.Параметры.Заполнить(ГлавныйБухгалтер);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьДоверенностьМ2()

#КонецЕсли
